ESP32Async/AsyncTCP/src/AsyncTCP.cpp
IPAddress AsyncClient::localIP6() const {
  if (!_pcb) {
    return IPAddress(IPType::IPv6);
  }
  IPAddress ip;
  ip.from_ip_addr_t(&(_pcb->local_ip));
  return ip;
}
#endif
#endif
#endif

uint16_t AsyncClient::getRemotePort() const {
  if (!_pcb) {
    return 0;
  }
  return _pcb->remote_port;
}

uint32_t AsyncClient::getLocalAddress() const {
  if (!_pcb) {
    return 0;
  }
#if LWIP_IPV4 && LWIP_IPV6
  return _pcb->local_ip.u_addr.ip4.addr;
#else
  return _pcb->local_ip.addr;
#endif
}

uint16_t AsyncClient::getLocalPort() const {
  if (!_pcb) {
    return 0;
  }
  return _pcb->local_port;
}

#if defined(USING_PURE_ESP_IDF_V5_PLUS)
ip4_addr_t AsyncClient::remoteIP() const {
  
  ip4_addr_t ip = {IPADDR_ANY};

  if (_pcb && _pcb->remote_ip.type == IPADDR_TYPE_V4) {
    ip = _pcb->remote_ip.u_addr.ip4;
  }
  return ip;
  
}
#else
IPAddress AsyncClient::remoteIP() const {
  #if ESP_IDF_VERSION_MAJOR < 5
    return IPAddress(getRemoteAddress());
  #else
    if (!_pcb) {
      return IPAddress();
    }
    IPAddress ip;
    ip.from_ip_addr_t(&(_pcb->remote_ip));
    return ip;
  #endif
  }
#endif

uint16_t AsyncClient::remotePort() const {
  return getRemotePort();
}

#if defined(USING_PURE_ESP_IDF_V5_PLUS)
ip4_addr_t AsyncClient::localIP() const {
  ip4_addr_t ip = {IPADDR_ANY};

  if (_pcb && _pcb->local_ip.type == IPADDR_TYPE_V4) {
    ip = _pcb->local_ip.u_addr.ip4;
  }

  return ip;
}
#else
IPAddress AsyncClient::localIP() const {
  #if ESP_IDF_VERSION_MAJOR < 5
    return IPAddress(getLocalAddress());
  #else
    if (!_pcb) {
      return IPAddress();
    }
    IPAddress ip;
    ip.from_ip_addr_t(&(_pcb->local_ip));
    return ip;
  #endif
  }
#endif

uint16_t AsyncClient::localPort() const {
  return getLocalPort();
}

uint8_t AsyncClient::state() const {
  if (!_pcb) {
    return 0;
  }
  return _pcb->state;
}

bool AsyncClient::connected() const {
  if (!_pcb) {
    return false;
  }
  return _pcb->state == ESTABLISHED;
}

bool AsyncClient::connecting() const {
  if (!_pcb) {
    return false;
  }
  return _pcb->state > CLOSED && _pcb->state < ESTABLISHED;
}

bool AsyncClient::disconnecting() const {
  if (!_pcb) {
    return false;
  }
  return _pcb->state > ESTABLISHED && _pcb->state < TIME_WAIT;
}

bool AsyncClient::disconnected() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state == TIME_WAIT;
}

bool AsyncClient::freeable() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state > ESTABLISHED;
}

bool AsyncClient::canSend() const {
  return space() > 0;
}

const char *AsyncClient::errorToString(int8_t error) {
  switch (error) {
    case ERR_OK:         return "OK";
    case ERR_MEM:        return "Out of memory error";
    case ERR_BUF:        return "Buffer error";
    case ERR_TIMEOUT:    return "Timeout";
    case ERR_RTE:        return "Routing problem";
    case ERR_INPROGRESS: return "Operation in progress";
    case ERR_VAL:        return "Illegal value";
    case ERR_WOULDBLOCK: return "Operation would block";
    case ERR_USE:        return "Address in use";
    case ERR_ALREADY:    return "Already connected";
    case ERR_CONN:       return "Not connected";
    case ERR_IF:         return "Low-level netif error";
    case ERR_ABRT:       return "Connection aborted";
    case ERR_RST:        return "Connection reset";
    case ERR_CLSD:       return "Connection closed";
    case ERR_ARG:        return "Illegal argument";
    case -55:            return "DNS failed";
    default:             return "UNKNOWN";
  }
}

const char *AsyncClient::stateToString() const {
  switch (state()) {
    case 0:  return "Closed";
    case 1:  return "Listen";
    case 2:  return "SYN Sent";
    case 3:  return "SYN Received";
    case 4:  return "Established";
    case 5:  return "FIN Wait 1";
    case 6:  return "FIN Wait 2";
    case 7:  return "Close Wait";
    case 8:  return "Closing";
    case 9:  return "Last ACK";
    case 10: return "Time Wait";
    default: return "UNKNOWN";
  }
}

/*
 * Static Callbacks (LwIP C2C++ interconnect)
 * */

void AsyncClient::_s_dns_found(const char *name, struct ip_addr *ipaddr, void *arg) {
  reinterpret_cast<AsyncClient *>(arg)->_dns_found(ipaddr);
}

int8_t AsyncClient::_s_poll(void *arg, struct tcp_pcb *pcb) {
  return reinterpret_cast<AsyncClient *>(arg)->_poll(pcb);
}

int8_t AsyncClient::_s_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, int8_t err) {
  return reinterpret_cast<AsyncClient *>(arg)->_recv(pcb, pb, err);
}

int8_t AsyncClient::_s_fin(void *arg, struct tcp_pcb *pcb, int8_t err) {
  return reinterpret_cast<AsyncClient *>(arg)->_fin(pcb, err);
}

int8_t AsyncClient::_s_lwip_fin(void *arg, struct tcp_pcb *pcb, int8_t err) {
  return reinterpret_cast<AsyncClient *>(arg)->_lwip_fin(pcb, err);
}

int8_t AsyncClient::_s_sent(void *arg, struct tcp_pcb *pcb, uint16_t len) {
  return reinterpret_cast<AsyncClient *>(arg)->_sent(pcb, len);
}

void AsyncClient::_s_error(void *arg, int8_t err) {
  reinterpret_cast<AsyncClient *>(arg)->_error(err);
}

int8_t AsyncClient::_s_connected(void *arg, struct tcp_pcb *pcb, int8_t err) {
  return reinterpret_cast<AsyncClient *>(arg)->_connected(pcb, err);
}

/*
  Async TCP Server
 */

#if defined(USING_PURE_ESP_IDF_V5_PLUS)
AsyncServer::AsyncServer(ip_addr_t addr, uint16_t port)
  : _port(port), _bind4(addr.type == IPADDR_TYPE_V4), _bind6(addr.type == IPADDR_TYPE_V6), _addr(addr), _noDelay(false), _pcb(nullptr), _connect_cb(nullptr),
    _connect_cb_arg(nullptr) {}
#else
AsyncServer::AsyncServer(IPAddress addr, uint16_t port)
  : _port(port)
#if ESP_IDF_VERSION_MAJOR < 5
    ,
    _bind4(true), _bind6(false)
#else
    ,
    _bind4(addr.type() != IPType::IPv6), _bind6(addr.type() == IPType::IPv6)
#endif
    ,
    _addr(addr), _noDelay(false), _pcb(0), _connect_cb(0), _connect_cb_arg(0) {
}

#if ESP_IDF_VERSION_MAJOR < 5
AsyncServer::AsyncServer(IPv6Address addr, uint16_t port)
  : _port(port), _bind4(false), _bind6(true), _addr6(addr), _noDelay(false), _pcb(0), _connect_cb(0), _connect_cb_arg(0) {}
#endif
#endif


#if defined(USING_PURE_ESP_IDF_V5_PLUS)
AsyncServer::AsyncServer(uint16_t port)
  : _port(port), _bind4(true), _bind6(false), _addr({}),
    _noDelay(false), _pcb(nullptr), _connect_cb(nullptr), _connect_cb_arg(nullptr) {}
#else
AsyncServer::AsyncServer(uint16_t port)
  : _port(port), _bind4(true), _bind6(false), _addr((uint32_t)IPADDR_ANY)
#if ESP_IDF_VERSION_MAJOR < 5
    ,
    _addr6()
#endif
    ,
    _noDelay(false), _pcb(0), _connect_cb(0), _connect_cb_arg(0) {
}
#endif

AsyncServer::~AsyncServer() {
  end();
}

